public class Bits8 {

    public static void main(String[] args) {
        // Задание 8.  Обнулить крайний левый (старший разряд) единичный
        //        бит числа N. Вывести результат на консоль в двоичном виде
     int N=0;
     int j =(N <<2);
        System.out.println(Integer.toBinaryString(j));
    }
}
