import java.util.BitSet;

public class Bits4 {

    public static void main(String[] args) {
        // Задание 4.Инвертировать i-й бит числа N  . Вывести результат на консоль в двоичном виде

        int  N= 0, i;
        i= ~N;
        System.out.println(Integer.toBinaryString(i));

    }
}
